rottenpotatoes/app/controllers/movies_controller.rb

  def find_movies_with_same_director

    @dyrect = Movie.find_by_id(params[:id]).director
    if @dyrect.nil? || @dyrect.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "Ridley Scott"]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]